```jsx
import React from 'react';
import './App.css';
import emailjs from 'emailjs-com';

function App() {
  const content = {
    about: '📖 ስለ እኛ',
    services: '🛍️ ምርቶች እና 🛠️ አገልግሎቶች',
    testimonials: '⭐ ምስክርነቶች',
    contact: '📞 አግኙን',
    home: '🏠 መነሻ',
    welcome: '👕 ናድ ጨርቃጨርቅና 👔 አልባሳት 📊 ትሬዲንግ 🏢 አክሲዮን ማኅበር',
    description: '🎯 ጥራት፣ 🔄 መራራትነትና 💡 ኢኖቬሽን በማጣመር 🎁 የተቀረበ እጅግ 🏆 የተሻለ 🏭 አምራችነት።',
    aboutText: '🏭 ናድ ጨርቃጨርቅና አልባሳት ትሬዲንግ አክሲዮን ማኅበር 🌆 በሸገር ከተማ 📍 በለጋ ቴፎ 🏙️ የሚገኝ ⚡ ዘመናዊ 🏗️ ሥነ-ምህዳር 👕 ጨርቃጨርቅና 👗 አልባሳት 🏭 አምራች ነው። 🚀 የላቀ ቴክኖሎጂን 🔄 ከዘላቂ የአመራረት ልምዶች ጋር 🤝 በማጣመር 🌍 ለሀገር ውስጥ 🏪 እና 🌐 ለአለም አቀፍ 🛒 ገበያዎች 💎 ከፍተኛ ጥራት 🎯 ያላቸውን 👕 ጨርቆች እና 👔 አልባሳት 🔨 በማምረት 📈 ላይ 🏆 እንሰራለን።',
    servicesOffered: '📦 ምርቶች 🛠️ እና 🔧 አገልግሎቶች',
    largeScaleDesign: '👨‍💼 • ለወንዶች፣ 👩‍💼 ለሴቶች 🧒 እና 👶 ለልጆች 🎨 የተሸመኑ እና 🧵 የተጠለፉ 👕 ልብሶች',
    problemSolving: '👔 • የስራ ልብስ 🏢 እና 🎖️ ዩኒፎርም',
    serverAdmin: '🏠 • የቤት ውስጥ 🛏️ ጨርቃ ጨርቅ (🛏️ አልጋ አንሶላ፣ 🛋️ ፎጣ፣ 🪟 መጋረጃዎች)',
    programmingLanguages: '🎯 • ብጁ 👕 ጨርቅ 🧵 እና 👔 ልብስ 🔨 ማምረት',
    phpFrameworks: '💰 • የጨርቃጨርቅ 🏪 ግብይት 📦 እና 🔗 ምንጭ 🛒 አገልግሎቶች',
    jsFrameworks: '🏭 ምርት 🚀 እና ⚙️ ቴክኖሎጂ',
    htmlCss: '🏭 የኛ ፋብሪካ 📏 45,000 m² 📐 ሲሆን ✂️ የመቁረጫ፣ 🧵 የስፌት
